package day10;

//public class Mision 

//}1.
//아래 조건에
//맞게 클래스를 작성하시오.조건 1. 클래스명:
//Student 조건 2.
//
//필드(변수) : stuNo(학번, int)
//					stuName(이름, String)
//					stuDept(학과, String)
//					age(나이, int)
//					gender(성별, String)
//조건 3. 생성자 : 1. 학번, 이름 초기화 하는 생성자
//			  2. 학번, 이름, 학과 초기화 하는 생성자
//조건 4. 메소드 : 1.
//
//setInfo
//			 (나이와 성별을 입력받아서 저장, 리턴 x)
//			  2. getAge
//			  (호출 시 객체의 나이 값 리턴)
//			  3. toString
//			  (호출 시 'ooo(이름) 학생의 학번은 oooo(학번),
//
//나이는 oo(나이) 입니다.' 문자열 리턴
//조건 5. 메인 메소드에서 해당 클래스를 이용하여 객체 생성 및 호출
//           1. 객체명 : hong, 이름 : 홍길동, 학번 : 1234
//           2. 객체명 : yu, 이름 : 유재석 : 학번 : 1357, 학과 : 컴퓨터학과
//           3. hong 객채에서 setInfo를 통해
//
//값 입력(나이 : 20, 성별 : 남)
//           4. hong 객체에서 getAge 호출 후 해당 값 출력
//			5. yu 객체에서 toString 메소드 리턴 결과를 화면에 출력
//2-1. 아래 조건에 맞게 클래스를 작성하시오.
//- 클래스명 : Calc
//- 메소드 : sum, multiple
//- 위 메소드 들은 객체 생성없이 클래스명으로 호출가능하도록
//- 위에서 정의한 메소드는 각각 2개의 정수를 받아서 덧셈, 곱셈 결과를 리턴
//
//2-2. 해당 클래스의 multiple 메소드를 아래조건에 맞게 수정하시오.
//- 오버로딩하여 3개의 메소드로
//
//만들기(매개변수 수정은 자유롭게)
//2-3. main이 포함된 클래스를 생성하고 main 메소드 내에 아래 조건에 맞게 작성하시오.
//- Calc클래스의 메소드를 호출하시오(sum 1개, multiple 3개)
